export const page1Data = {
    "run_rate": 80,
    "device_list": [
        {
            "device_sn": "sn0",
            "device_name": "设备0",
            "device_type": "2",
            "device_runtime": "3419小时",
            "device_abnormaltime": "56分钟",
            "device_runstate": "1",
            "temp_sensor_infos": [
                {
                    "sensor_sn": "sensor_temp_0",
                    "sensor_runstate": "1"
                }
            ],
            "elec_sensor_infos": [
                {
                    "sensor_sn": "sensor_elec_0",
                    "sensor_runstate": "1"
                }
            ]
        },
        {
            "device_sn": "sn4",
            "device_name": "设备4",
            "device_type": "2",
            "device_runtime": "3743小时",
            "device_abnormaltime": "33分钟",
            "device_runstate": "1",
            "temp_sensor_infos": [
                {
                    "sensor_sn": "sensor_temp_4",
                    "sensor_runstate": "1"
                }
            ],
            "elec_sensor_infos": [
                {
                    "sensor_sn": "sensor_elec_4",
                    "sensor_runstate": "1"
                }
            ]
        },
        {
            "device_sn": "sn1",
            "device_name": "设备1",
            "device_type": "1",
            "device_runtime": "7742小时",
            "device_abnormaltime": "48分钟",
            "device_runstate": "1",
            "temp_sensor_infos": [
                {
                    "sensor_sn": "sensor_temp_1",
                    "sensor_runstate": "1"
                }
            ],
            "elec_sensor_infos": [
                {
                    "sensor_sn": "sensor_elec_1",
                    "sensor_runstate": "0"
                }
            ]
        },
        {
            "device_sn": "sn3",
            "device_name": "设备3",
            "device_type": "1",
            "device_runtime": "6314小时",
            "device_abnormaltime": "6分钟",
            "device_runstate": "0",
            "temp_sensor_infos": [
                {
                    "sensor_sn": "sensor_temp_3",
                    "sensor_runstate": "0"
                }
            ],
            "elec_sensor_infos": [
                {
                    "sensor_sn": "sensor_elec_3",
                    "sensor_runstate": "1"
                }
            ]
        },
        {
            "device_sn": "sn2",
            "device_name": "设备2",
            "device_type": "3",
            "device_runtime": "4947小时",
            "device_abnormaltime": "23分钟",
            "device_runstate": "1",
            "temp_sensor_infos": [
                {
                    "sensor_sn": "sensor_temp_2",
                    "sensor_runstate": "1"
                }
            ],
            "elec_sensor_infos": [
                {
                    "sensor_sn": "sensor_elec_2",
                    "sensor_runstate": "1"
                }
            ]
        }
    ]
}

export const page2Data = [

    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [1, 2, 32, 14, 51],
                    [1, 12, 23, 41, 15],
                    [1, 22, 31, 24, 52],
                    [1, 32, 13, 42, 25],
                ],
            },
            {
                name: "温振2",
                axis: ["X轴", "Y轴", "Z轴", "温度"],
                data: [
                    [11, 12, 3, 4, 5],
                    [12, 21, 3, 4, 5],
                    [13, 32, 3, 4, 5],
                    [14, 23, 3, 4, 5],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
];

export const page3Data = [
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
    {
        name: "设备1",
        list: [
            {
                name: "温振1",
                axis: ["A相", "B相", "C相"],
                data: [
                    [11, 12, 13, 4, 5],
                    [21, 21, 31, 14, 51],
                    [31, 22, 43, 41, 15],
                ],
            },
        ],
        time: ["09:10", "10:10", "11:10", "12:10", "13:10"],
    },
];